Revit 2027 API
DisciplineTypeId.Electrical Property
 Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Electrical { get; }
Public Shared ReadOnly Property Electrical As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Electrical {
	ForgeTypeId^ get ();
}
static member Electrical : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
DisciplineTypeId Class
Autodesk.Revit.DB Namespace